/*
ФИО: Рябцев Владимир Дмитриевич
Группа: БИВ141
Вариант 1 л/р: 22 по списку -> 11 (что храним) и 7 (виды хранилищ)
Задание:
    Доработать приложение, разработанное в ЛР5. В хранилище обращаются несколько независимых потоков
    производителей и потребителей. В отдельном потоке происходит обработка действий пользователя с GUI
    интерфейсом. С помощью механизма слотов или сообщений организовать индекацию заполненности хранилища.
    Производить вывод информации о действиях потоков в qDebug.
Введение:
    Создать 4 класса для работы потоков:
        добавление, удаление элемента и сохранение, загрузка из файла контейнера.
    В классы передавать контейнер и производить действия над ним. Т.е. он там может меняться.
    Использовать QThread для создания нового потока и связывать его с помощью сигналов и слотов с текущим
    объектом класса.
Постановка задачи:
    Необходимо сделать следующиие пункты:
        1) Написать ТЗ.
        2) Разработать потоки производителей и потребителей.
        3) Использовать механизмы слотов или сообщений.
        4) Использовать мьютексты или семафоры.
        5) Создать автоматическую синхронизацию контейнера с локальным файлом.
Выводы:
    Были выполнены пункты: 1, 2, 3, 4, 5.
    Были добавлены потоки.
    Программа работает быстрее из-за многопоточности.
    Автоматическое сохранение в файл при любом изменении контейнера.
    Автоматическая загрузка из файла при старте программы.
*/

#include "dialog.h"
#include <QApplication>

int main(int argc, char *argv[])
{
    QApplication a(argc, argv);
    Dialog w;
    w.setWindowTitle("Library of Books");
    w.show();

    return a.exec();
}

/*
@todo
-переработать сортировку объектов (сделать выбор полей при вызова сортировки)
-переработать логические операторы  у книг (нелогичное сравнение)
-создавать копии объектов при добавлении в контейнер
*/
